In [33]:
import pandas as pd
import numpy as np

In [34]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [35]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [36]:
df.fillna(value=0,inplace=True)

In [37]:
df["FlightNumber"]=df["FlightNumber"]+10

In [38]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10055.0      [23, 47]               KLM(!)
1      MAdrid_miLAN          10.0            []    <Air France> (12)
2  londON_StockhOlm       10075.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          10.0          [13]       12. Air France
4   Brussels_londOn       10095.0      [67, 32]          "Swiss Air"

In [39]:
df.FlightNumber=df.FlightNumber.astype("int64")

In [40]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            10            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            10          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

In [41]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [46]:
type(df["From_To"])

pandas.core.series.Series

In [51]:
akhil=list(df["From_To"])

In [52]:
akhil

['LoNDon_paris',
 'MAdrid_miLAN',
 'londON_StockhOlm',
 'Budapest_PaRis',
 'Brussels_londOn']

In [57]:
a=[]
for i in range(len(akhil)):
    a.append(akhil[i].split("_"))

In [58]:
a

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [75]:
From=[]
for i in range (5):
    From.append(a[i][0])

In [76]:
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [77]:
To=[]
for i in range(5):
    To.append(a[i][1])

In [78]:
To

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [92]:
for i in range (5):
    To[i]=To[i].replace(To[i],To[i].capitalize())
    From[i]=From[i].replace(From[i],From[i].capitalize())

In [93]:
df["From"]=From

In [94]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10055,"[23, 47]",KLM(!),London,paris
1,MAdrid_miLAN,10,[],<Air France> (12),Madrid,miLAN
2,londON_StockhOlm,10075,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,Budapest_PaRis,10,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10095,"[67, 32]","""Swiss Air""",Brussels,londOn

In [95]:
df["To"]=To

In [96]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10055,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10075,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10095,"[67, 32]","""Swiss Air""",Brussels,London

In [97]:
df.drop("From_To",axis=1)

   FlightNumber  RecentDelays              Airline      From         To
0         10055      [23, 47]               KLM(!)    London      Paris
1            10            []    <Air France> (12)    Madrid      Milan
2         10075  [24, 43, 87]  (British Airways. )    London  Stockholm
3            10          [13]       12. Air France  Budapest      Paris
4         10095      [67, 32]          "Swiss Air"  Brussels     London

In [98]:
df["RecentDelays"]

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [99]:
delay=list(df["RecentDelays"])

In [100]:
delay

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [128]:
delay1=[]
delay2=[]
delay3=[]

In [129]:
for i in range (5):
    a=len(delay[i])
    if(a<1):
        delay1.append("NaN")
    else:
        delay1.append(delay[i][0])
        
    if(a<2):
        delay2.append("NaN")
    else:
        delay2.append(delay[i][1])
     
    if(a<3):
        delay3.append("NaN")
    else:
        delay3.append(delay[i][2])

In [124]:
len(delay[1])

0

In [130]:
delay1
delay2
delay3

['NaN', 'NaN', 87, 'NaN', 'NaN']

In [131]:
delay1

[23, 'NaN', 24, 13, 67]

In [132]:
delay2

[47, 'NaN', 43, 'NaN', 32]

In [133]:
df["Delay_1"] = delay1

In [134]:
df["Delay_2"] =delay2

In [135]:
df["Delay_3"] = delay3

In [136]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To,Delay_1,Delay_2,Delay_3
0,LoNDon_paris,10055,"[23, 47]",KLM(!),London,Paris,23,47,NaN
1,MAdrid_miLAN,10,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,londON_StockhOlm,10075,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,Budapest_PaRis,10,[13],12. Air France,Budapest,Paris,13,NaN,NaN
4,Brussels_londOn,10095,"[67, 32]","""Swiss Air""",Brussels,London,67,32,NaN

In [138]:
df.drop("RecentDelays",axis=1)

,From_To,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,LoNDon_paris,10055,KLM(!),London,Paris,23,47,NaN
1,MAdrid_miLAN,10,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,londON_StockhOlm,10075,(British Airways. ),London,Stockholm,24,43,87
3,Budapest_PaRis,10,12. Air France,Budapest,Paris,13,NaN,NaN
4,Brussels_londOn,10095,"""Swiss Air""",Brussels,London,67,32,NaN